[
    {
        "quote": "Beta is latin for still doesn't work",
        "author": "Unknown",
        "year": null,
        "reference": null
    },
    {
        "quote": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
        "author": "Brian W. Kernighan",
        "year": null,
        "reference": null
    },
    {
        "quote": "If computers get too powerful, we can organize them into committees. That'll do them in",
        "author": "Unknown",
        "year": null,
        "reference": null
    },
    {
        "quote": "There are two ways of constructing a software design: One way is to make it so simple that there are obviously no deficiencies, and the other way is to make it so complicated that there are no obvious deficiencies. The first method is far more difficult.",
        "author": "C.A.R. Hoare",
        "year": null,
        "reference": null
    },
    {
        "quote": "C is quirky, flawed, and an enormous success.",
        "author": "Dennis M. Ritchie",
        "year": null,
        "reference": null
    },
    {
        "quote": "Every kid coming out of Harvard, every kid coming out of school now thinks he can be the next Mark Zuckerberg, and with these new technologies like cloud computing, he actually has a shot.",
        "author": "Marc Andreessen",
        "year": null,
        "reference": null
    },
    {
        "quote": "There are two ways of constructing a software design: One way is to make it so simple that there are obviously no deficiencies, and the other way is to make it so complicated that there are no obvious deficiencies. The first method is far more difficult.",
        "author": "C.A.R. Hoare",
        "year": null,
        "reference": null
    },
    {
        "quote": "Technology is a word that describes something that doesn’t work yet.",
        "author": "Douglas Adams",
        "year": null,
        "reference": null
    },
    {
        "quote": "It had nothing to do with using [programs] for practical things, it had more to do with using them as a mirror of your thought process. To actually learn how to think. I think everyone in this country should learn to program a computer. Everyone should learn a computer language because it teaches you how to think. I think of computer science as a liberal art.",
        "author": "Steve Jobs",
        "year": null,
        "reference": null
    },
    {
        "quote": "True innovation often comes from the small startup who is lean enough to launch a market but lacks the heft to own it.",
        "author": "Timm Martin",
        "year": null,
        "reference": null
    }
]